{
  "services": [
    {
      "id": 1,
      "question": "What is the difference between Service and IntentService?",
      "answer_blocks": [
        {
          "type": "text",
          "content": "A Service runs on the main thread of the application. If long operations are performed, the UI may freeze.
          The primary difference between an Android Service and an IntentService is how they handle multithreading and manage their own lifecycle. A standard Service runs on the application's main thread and requires manual thread management, while an IntentService uses a dedicated worker thread and automatically handles its own stopping. 
*Note: IntentService was deprecated in API level 30 (Android 11). For new apps, modern alternatives like WorkManager or JobIntentService are recommended, as they handle background tasks more efficiently and are compatible with the latest system restrictions. "
        },
        {
          "type": "images",
          "content": "https://raw.githubusercontent.com/Ravivarma14/Android_Interview_Questions/main/Images/services/service_types.png"
        },
        {
          "type": "text",
          "content": "An IntentService, however, creates a background worker thread to handle all tasks sequentially, preventing UI blocking."
        }
      ]
    }
  ],
  "multithreading": [
    {
      "id": 2,
      "question": "What is a Handler in Android?",
      "answer_blocks": [
        {
          "type": "text",
          "content": "Handler allows communication between background threads and the main UI thread."
        },
        {
          "type": "image",
          "content": "https://raw.githubusercontent.com/Ravivarma14/Android_Interview_Questions/main/Images/services/service_types.png"
        },
        {
          "type": "text",
          "content": "It posts messages and runnables to the MessageQueue, which the Looper executes on the target thread."
        }
      ]
    }
  ],
  "broadcast": [
    {
      "id": 3,
      "question": "What is a BroadcastReceiver in Android?",
      "answer_blocks": [
        {
          "type": "text",
          "content": "BroadcastReceiver is a component that responds to system-wide broadcast announcements."
        },
        {
          "type": "text",
          "content": "For example, when battery is low or WiFi state changes, Android sends broadcasts which can be received by apps."
        }
      ]
    }
  ]
}

